export const questions = {
    common: [
    `1. 다양한 IT 동아리 중에서 멋쟁이사자처럼 대학 12기를 선택하고 지원하시게 된 이유를 작성해 주세요. (* 공백 포함 600자 이내)`,
    `2. 위의 파트를 선택한 이유와 관련 경험을 해본 적이 있는지, 그리고 이 파트를 통해 어떠한 성장을 희망하시는지 작성해 주세요.
    (* 공백 포함 600자 이내)`,
    `3. 멋쟁이사자처럼 대학에서 한 학기 동안 배운 것을 바탕으로 한 달 동안 팀을 구성해 웹 서비스를 배포해야 합니다.
    개발하고 싶었던 웹 서비스가 있나요? 있다면, 아이디어에 대해 설명해 주세요. (* 공백 포함 600자 이내)`,
    `4. 2024년 기준으로, 지금까지 했던 일 중 가장 꾸준하게 한 일이 무엇인지 서술해 주세요. (* 공백 포함 600자 이내)`,
    `5. 열정을 다해서 도전을 해본 경험이 있다면, 도전의 경험을 구체적으로 설명해 주세요. (* 공백 포함 600자 이내) `,
    `6. 멋쟁이사자처럼 대학은 협업과 팀워크를 중요한 가치로 생각하는 공동체입니다.
    타인과 협업 또는 의사소통하면서 결과적으로 성공 또는 어려움을 극복했던 경험과 이를 통해 본인이 배운 점을 구체적으로 기술하여 주세요.
    꼭 개발에 관한 협업이 아니어도 됩니다. (* 공백 포함 600자 이내)`,
  ]
  };
  
  
export const agree = [
    `[개인정보 수집·이용 동의서]
  
    주식회사 멋쟁이사자처럼은 「정보통신망 이용촉진 및 정보보호에 관한 법률」 및 「개인정보보호법」 등 관련 법령상의 개인정보보호 규정을 준수하여 「멋쟁이사자처럼 대학 12기」 참가자의 개인정보 및 권익을 보호하고, 개인정보와 관련한 참가자의 고충을 원활하게 처리할 수 있도록 다음과 같은 개인정보 처리방침을 두고 있습니다.
            
    가. 개인 정보의 수집· 이용에 관한 사항
            
    ▣ 개인 정보의 수집· 이용 목적
            
    개인 정보는 1차적으로 본 프로그램 참가신청, 참가신청에 따른 본인확인, 개인식별, 프로그램 진행, 프로그램 관련 안내/고지사항 등의 전달, 문의사항 또는 불만사항 등의 확인 및 처리, 분쟁 조정을 위한 기록 보존 등을 위해 사용됩니다. 이후 멋쟁이사자처럼의 프로그램 및 브랜드 홍보를 위한 마케팅에 활용될 수 있습니다.
            
    ▣ 수집하는 개인 정보의 항목
            
    성명, 연락처, 이메일 등 신청 및 프로그램 운영 중 취득한 정보
            
    ▣ 개인 정보의 보유· 이용기간
            
    개인 정보는 원칙적으로 개인 정보의 수집 및 이용목적이 달성되면 지체 없이 파기합니다. 단, 본 사업 종료 후 참여 인정 문서 발급을 위한 최소한의 자료(성명, 학번, 학과, 연락처, 이메일)는 사업종료 이후 5년간 보존됩니다.
            
    ▣ 동의를 거부할 권리 및 동의를 거부할 경우의 불이익
            
    위 개인 정보의 수집· 이용에 거부할 권리가 있음을 알려드립니다. 단, 수집항목은 사업 진행을 위한 최소한의 필수 정보로서 개인 정보 수집· 이용에 동의하지 않으실 경우 프로그램 참가 및 제반 활동이 불가능합니다.
            
    나. 개인 정보 제3자 제공에 관한 사항
            
    ▣ 제공받는 자
            
    주식회사 멋쟁이사자처럼
            
    ▣ 제공받는 자의 목적
            
    ‘멋쟁이사자처럼 대학 12기 모집’ 진행 및 운영, 참가자 관리
            
    ▣ 제공하는 개인 정보 항목
            
    성명, 연락처, 이메일 등 신청 및 프로그램 운영 중 취득한 정보
            
    ▣ 동의를 거부할 권리 및 동의를 거부할 경우의 불이익
            
    위 제3자에 대한 개인 정보의 제공에 관한 동의를 거부할 수 있으나 본 프로그램 참가를 위해 필수적이므로 위 사항에 동의하셔야만 참가 및 활동이 가능합니다.`
  ]

export const scheduleData = [
      "2.29 목 10:00-10:40", "3.1 금 10:00-10:40",
      "2.29 목 11:00-11:40", "3.1 금 11:00-11:40",
      "2.29 목 12:00-12:40", "3.1 금 12:00-12:40",

      "2.29 목 14:00-14:40", "3.1 금 14:00-14:40",
      "2.29 목 15:00-15:40", "3.1 금 15:00-15:40",
      "2.29 목 16:00-16:40", "3.1 금 16:00-16:40",
      "2.29 목 17:00-17:40", "3.1 금 17:00-17:40",
      "2.29 목 18:00-18:40", "3.1 금 18:00-18:40",

      "2.29 목 20:00-20:40", "3.1 금 20:00-20:40",
      "2.29 목 21:00-21:40", "3.1 금 21:00-21:40",
    ];

export const required = [
        "아래는 숙명여대 멋쟁이사자처럼의 필수 참여 행사입니다. 불참 시 합격이 취소될 수 있으며, 활동 수료에 제한이 있을 수 있습니다.",
        "- 숙명여대 멋사 OT: 3/7(목) 19:00-21:00 *대면 진행, 불참 시 합격 취소",
        "- 멋사 중앙 OT: 3/21(수) 19:00 OT *온라인 진행, 불참 시 합격 취소",
        "- 중앙 아이디어톤: 6월 중 진행 *수료 요건",
        "- 중앙 해커톤: 8월 중순 진행 *수료 요건",
        "- 연합 해커톤: 7월 중 여대톤, 11월 중 4호선톤 *일정 변경 및 행사 여부는 주최 측 사정에 따라 변경될 수 있음. *수료 요건",
        "- 정기 세션: 2024년 3월~12월 매주 화요일 19:00-21:00 (공통 교육(1-N주차) & 파트 별 교육 N주차)",
      ];